#+title:  ~moo~ 無 ~oschema~
#+subtitle: Describing schema as objects
#+setupfile: other/setup-topic.org

#+name: grep
#+begin_src shell :var re="" :var file="/dev/null"  :var a=0 :var lang="shell" :exports none :results output code
grep -m1 -A$a "$re" "$file"
#+end_src

#+name: awk
#+begin_src shell :var re="" :var file="/dev/null" :var lang="shell" :exports none :results output code
awk "$re" "$file"
#+end_src

** Python
   :PROPERTIES:
   :CUSTOM_ID: python-trans
   :END:

Jsonnet is a "small" language (one of its charms) and some model
transformations may be complex enough that its simplicity poses a
limitation.  ~moo~ thus allows transformations to be defined in Python
and this opens up the ability to form the model in a more strong and
object-oriented manner.

To do this, the user may tell the ~moo~ CLI to apply a Python function
to transform the input data just prior to the application of the
template.  The function is specified as a "dot" path naming the
function in its module.  We may use the ~moo dump~ command to
illustrate a transformation applied to the ~app~ schema:

#+begin_src shell :exports both :results output code :wrap "src python"
  moo -M examples/oschema -t moo.oschema.typify dump -f pretty app.jsonnet
#+end_src

#+RESULTS:
#+begin_example
[<Any "app.Affiliation">,
 <Sequence "app.Counts" items:sys.Count>,
 <String "app.Email">,
 <Enum "app.MBTI">,
 <Record "app.Person" fields:{email, counts, affil, mbti}>]
#+end_example

The built-in ~moo.oschema.typify()~ function illustrated here converts a
schema type as a "raw" data structure into a corresponding Python
object.  In a template, the Python object should be usable everywhere
the "raw" data structure.  The ~typify()~ transform is thus only useful
if the extensions that the Python object provides are needed in a
template or if subsequent transforms require objects instead of raw
data structures (an example of which we'll see next).

We may also pipeline transformations.  Here is an example that will
use the output of ~typify()~, form a graph from the type reference
dependencies, and perform a [[https://en.wikipedia.org/wiki/Topological_sorting][topological sort]] to produce an array which
are ordered from least dependent to most.  

#+begin_src shell :exports both :results output code :wrap "example"
  moo -T examples/oschema -M examples/oschema \
      -t 'moo.oschema.typify|moo.oschema.graph|moo.oschema.depsort' \
        render app.jsonnet ool.txt.j2
#+end_src

#+RESULTS:
#+begin_example
Iterate over list of types:
<Number "sys.Count">
<Any "app.Affiliation">
<Sequence "app.Counts" items:sys.Count>
<String "app.Email">
<Enum "app.MBTI">
<String "app.Make">
<String "app.Model">
<Enum "app.VehicleClass">
<Record "app.Vehicle" fields:{make, model, type}>
<Record "app.Person" fields:{email, email2, counts, counts2, affil, mbti, vehicle, vehicle2, vehicle2}>
#+end_example

Note the ~Person~ type comes after the types that it refers to in its
fields due to the topological sort.  Also, note that this particular
transform may also be performed in the Jsonnet layer and so is used
here as an illustration of the functionality.

This example also shows that the pipeline of transformations may
becomes rather complex.  At some point, developing a composite
transformation function in Python and referring to it on the ~moo~ CLI
may be useful to keep the command argument list small.  

But, let us now move on to codegen.


** Model
   :PROPERTIES:
   :CUSTOM_ID: model
   :END:

The ~omodel~ contract is embodied in this Jsonnet file:

#+include: moo/jsonnet-code/omodel.jsonnet src jsonnet

The top-level arguments are described below.  What is produced is an
object (ie, an instance of the model) with these attributes:

- ~path~ :: the ~namespace~ path scope to focus on as a list/array
- ~nspre~ :: ~namespace~ prefix with trailing dot
- ~types~ :: array of type data structures which are in scope
- ~byref~ :: full type information retrieved via a type reference
- ~byscn~ :: references to types collected by schema class
- ~extref~ :: list of references to types outside the scope

Top-level arguments

- ~os~ :: bring in the ~oschema~ array
- ~path~ :: the ~namespace~ path with which select a branch on the full schema tree

We can test out some TLAs and test that the model compiles using the ~moo~ CLI:

#+begin_src shell :exports code :results none
  moo -M examples/oschema \
    -A os='app.jsonnet' -A path='app' \
       compile omodel.jsonnet
#+end_src

We want to apply a transform to the ~types~ attribute and can test that
with.  This can be done by with this command.  We will hold off on
showing the output until the next example CLI.


#+begin_src shell :exports code :results none
  moo -M examples/oschema \
    -A os='app.jsonnet' -A path='app' \
    -t '/types:moo.oschema.typify|moo.oschema.graph|moo.oschema.depsort' \
       dump -f pretty omodel.jsonnet
#+end_src

We are almost ready to turn to the template but one last detail is
needed.  As we will find there are some utilities that will simplify
developing the template and which are specific to the target-language
(eg C++) and which the rest of the model does not depend.  We will
bring these in as a model "graft".


#+begin_src shell :exports both :results output code :wrap "example"
  moo -g '/lang:ocpp.jsonnet' \
      -M examples/oschema \
      -A os='app.jsonnet' -A path='app' \
      -t '/types:moo.oschema.typify|moo.oschema.graph|moo.oschema.depsort' \
      dump -f types omodel.jsonnet
#+end_src

#+RESULTS:
#+begin_example
all_types <class 'list'>
byref <class 'dict'>
byscn <class 'dict'>
ctxpath <class 'list'>
ctxpre <class 'str'>
extrefs <class 'list'>
nspre <class 'str'>
path <class 'list'>
relpath <class 'str'>
types <class 'list'>
lang <class 'dict'>
#+end_example

If you squint you'll see the ~lang~ attribute added with others from the
model.  Let's now move to the template.



